In [1]:
import numpy as np

In [2]:
import pandas as pd

In [3]:
pd.DataFrame({'Yes':[50,21],'No':[131,2]})

   Yes   No
0   50  131
1   21    2

In [4]:
Dataset= pd.read_csv("Data.csv")

In [5]:
Dataset

   Country   Age   Salary Purchased
0   France  44.0  72000.0        No
1    Spain  27.0  48000.0       Yes
2  Germany  30.0  54000.0        No
3    Spain  38.0  61000.0        No
4  Germany  40.0      NaN       Yes
5   France  35.0  58000.0       Yes
6    Spain   NaN  52000.0        No
7   France  48.0  79000.0       Yes
8  Germany  50.0  83000.0        No
9   France  37.0  67000.0       Yes

In [6]:
Dataset.shape

(10, 4)

In [7]:
Dataset.head()

   Country   Age   Salary Purchased
0   France  44.0  72000.0        No
1    Spain  27.0  48000.0       Yes
2  Germany  30.0  54000.0        No
3    Spain  38.0  61000.0        No
4  Germany  40.0      NaN       Yes

In [8]:
Dataset['Country']

0     France
1      Spain
2    Germany
3      Spain
4    Germany
5     France
6      Spain
7     France
8    Germany
9     France
Name: Country, dtype: object

In [9]:
Dataset['Country'][0:3]

0     France
1      Spain
2    Germany
Name: Country, dtype: object

In [10]:
Dataset.Country=='Germany'

0    False
1    False
2     True
3    False
4     True
5    False
6    False
7    False
8     True
9    False
Name: Country, dtype: bool

In [11]:
Dataset.loc[Dataset.Country=='Germany']

   Country   Age   Salary Purchased
2  Germany  30.0  54000.0        No
4  Germany  40.0      NaN       Yes
8  Germany  50.0  83000.0        No

In [12]:
Germany_Column = Dataset.loc[Dataset.Country=='Germany']

In [13]:
Germany_Column

   Country   Age   Salary Purchased
2  Germany  30.0  54000.0        No
4  Germany  40.0      NaN       Yes
8  Germany  50.0  83000.0        No

In [14]:
Germany_Column.to_csv('GermanyData.csv')

In [23]:
Dataset.loc[Dataset.Salary.isnull()]

   Country   Age  Salary Purchased
4  Germany  40.0     NaN       Yes

In [21]:
Dataset.loc[Dataset.Salary.notnull()]

   Country   Age   Salary Purchased
0   France  44.0  72000.0        No
1    Spain  27.0  48000.0       Yes
2  Germany  30.0  54000.0        No
3    Spain  38.0  61000.0        No
5   France  35.0  58000.0       Yes
6    Spain   NaN  52000.0        No
7   France  48.0  79000.0       Yes
8  Germany  50.0  83000.0        No
9   France  37.0  67000.0       Yes

In [26]:
#assigning a value to a specific row
Dataset.loc[0, 'Salary'] = 100000

In [25]:
Dataset

   Country   Age    Salary Purchased
0   France  44.0  100000.0        No
1    Spain  27.0   48000.0       Yes
2  Germany  30.0   54000.0        No
3    Spain  38.0   61000.0        No
4  Germany  40.0       NaN       Yes
5   France  35.0   58000.0       Yes
6    Spain   NaN   52000.0        No
7   France  48.0   79000.0       Yes
8  Germany  50.0   83000.0        No
9   France  37.0   67000.0       Yes

In [28]:
Dataset.Salary.describe()

count         9.000000
mean      66888.888889
std       17178.798302
min       48000.000000
25%       54000.000000
50%       61000.000000
75%       79000.000000
max      100000.000000
Name: Salary, dtype: float64

In [30]:
Dataset.Country.unique()

array(['France', 'Spain', 'Germany'], dtype=object)

In [33]:
Dataset.dtypes

Country       object
Age          float64
Salary       float64
Purchased     object
dtype: object